davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
  //init peripheral (not turbo mode, poll every 250ms, if touch sample at 40Hz until no touch)
  if (setup_iqs263() == HAL_ERROR) {
	  strncpy(errorCondition, "ERR:IQS263ST", sizeof(errorCondition));
	  GlobalState.programMode = MODE_ERROR;
  }

    /* Infinite loop */
    for(;;)
    {

     // -- Adjust/Dial in Angle Mapping for Touch Sensor -- //
     //uint16_t current_angle = iqs263_get_angle();
     //er_oled_clear(oled_buf);
     //sprintf (time, "%d", current_angle);
     //er_oled_string(0, 0, time, 12, 1, oled_buf);
     //er_oled_display(oled_buf);
     // /* comment out when doing angle adjustments

	 current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
     if (current_minute != -1) { //touch!

       if (!touch_end_count){ //START TOUCH EVENT!

    	   er_oled_clear(oled_buf);

    	   switch (GlobalState.programMode) {
    	   	   case MODE_ESM_TIME_ESTIMATE:
    	   	       xTaskNotifyGive(esmMainHandle);
           		   er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
           		   break;
    	   	   case MODE_ESM_SURVEY:
    	   	       er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);
    	   	       break;
    	   	   case MODE_RESTING:
    			   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			   GlobalState.programMode = MODE_TIME_ESTIMATE;
    			   osMutexRelease(modeMutexHandle);
    			   //fall through to next case
    	   	   case MODE_TIME_ESTIMATE:
    	   		   er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
          		   break;
    	   }

           //if we're guessing the time, on start of touch we need to grab
           //the hour of the last seen time as a starting point.
           if (GlobalState.programMode == MODE_TIME_ESTIMATE ||
               GlobalState.programMode == MODE_ESM_TIME_ESTIMATE){

                osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
                cTime = GlobalState.lastSeenTime.time;
                osMutexRelease(lastSeenMutexHandle);

                hrs = RTC_Bcd2ToByte(cTime.Hours);
                mins = 0x00;
           }

           //on immediate touch set history to current minute
           for (i=0; i < TOUCH_HISTORY_SIZE; i++){
        	   minute_history[i] = current_minute;
           }
       }

       touch_end_count = 1;

       //put current minute in history buffer and advance circular index
       minute_history[history_ind] = current_minute;
       history_ind = (history_ind + 1) % TOUCH_HISTORY_SIZE;

       //TWO MODES - fast and slow
       // if large variation (min and max in buffer > 3 min) set display_time to current_time, else average

       //take average of buffer, get min and max; that's what should be displayed
       display_minute = 0;
       min_minute = 60;
       max_minute = 0;
       for (i=0; i< TOUCH_HISTORY_SIZE; i++){
    	   display_minute += minute_history[i];
    	   if (minute_history[i] < min_minute) min_minute = minute_history[i];
    	   if (minute_history[i] > max_minute) max_minute = minute_history[i];
       }

       if (max_minute-min_minute > 4) {
    	   display_minute = current_minute;
       } else {
    	   display_minute /= TOUCH_HISTORY_SIZE;
       }

       //if last displayed is not what should be displayed, display
  	   if (last_display_minute != display_minute) { //UPDATE TOUCH VALUE!

           switch (GlobalState.programMode){
                case MODE_ESM_SURVEY:
                    //clear bottom
                    er_oled_clear_bottom_third(oled_buf);

                    //divide 10-50 min into option steps roughly
                    step = 45 / (GlobalState.surveyState.optionArrayLength+1);
                    for (i=0; i<GlobalState.surveyState.optionArrayLength; i++){
                        //map minute to option
                        if(display_minute >= (15 + i*step) &&
                           display_minute < (15 + (i+1)*step)){
                            er_oled_string(0, 28, GlobalState.surveyState.optionArray[GlobalState.surveyState.optionArrayLength-1-i], 12, 1, oled_buf);
                        }
                    }
                    er_oled_display(oled_buf);

                    break;
                case MODE_TIME_ESTIMATE:
                case MODE_ESM_TIME_ESTIMATE:

                    //hours wrap
                    if (display_minute < 15 &&
                        display_minute >= 0 &&
                        last_display_minute > 45){
                        hrs = (hrs+1)%24;

                    } else if (display_minute > 45 &&
                               last_display_minute < 15){
                        if (hrs==0) {hrs = 23;}
                        else {hrs -= 1;}
                    }

                    //display time on bottom two thirds
                    sprintf (time, "%02d%02d", hrs, display_minute);
                    er_oled_time_twothird(time, oled_buf);

                    break;
           }

           last_display_minute = display_minute;

  	   }


     } else if (touch_end_count > 0){

  	   touch_end_count += 1;//increment touching_end_count

  	   if (touch_end_count >= TOUCH_END_TIMEOUT){  //FINISHED/CONFIRMED TOUCH VALUE!
  		   uint8_t option = 0xFF;

  		   switch (GlobalState.programMode){
  		   	   case MODE_ESM_SURVEY:
  		   		   //grab current option
  		   		   for (i=0; i<GlobalState.surveyState.optionArrayLength; i++){
  		   		     //map minute to option
  		   		     if(last_display_minute >= (15 + i*step) &&
  		   		        last_display_minute < (15 + (i+1)*step)){
  		   		         option = GlobalState.surveyState.optionArrayLength-1-i;
  		   		     }
  		   		   }

  		   		   //send to ble
  		   		   bleSendData.sendType = TX_SURVEY_RESULT;
  		   		   bleSendData.data = (GlobalState.surveyState.surveyID << 8) | option;
  		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

  		   		   //notify main thread
  		   		   xTaskNotifyGive(esmMainHandle);
  		   		   break;

  		   	   case MODE_ESM_TIME_ESTIMATE:
  		   		   //send to ble
  		   		   bleSendData.sendType = TX_TIME_EST;
  		   		   bleSendData.data = (hrs << 8) | last_display_minute;
   		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

   		   		   //notify main thread
   		   		   xTaskNotifyGive(esmMainHandle);
  		   		   break;

  		   	   case MODE_TIME_ESTIMATE:
  		   		   //send to ble
  		   		   bleSendData.sendType = TX_TIME_EST;
  		   		   bleSendData.data = (hrs << 8) | last_display_minute;
   		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

