davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
   		   		   //not from main thread, show time (which updates seen time, new interval, back to rest)
  		   		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				   GlobalState.programMode = MODE_SHOW_TIME;
				   osMutexRelease(modeMutexHandle);
				   break;
  		   }

  		   touch_end_count = 0;
  		   last_display_minute = -1;
  		   er_oled_clear(oled_buf);
  		   er_oled_display(oled_buf);

  	   }

  	   osDelay(50);


     }else { //no touch, wait for a touch

       switch (GlobalState.programMode){
        case MODE_CANCEL:
    	   //had a 'cancel' button event

    	   er_oled_clear(oled_buf);
   	   	   er_oled_string(0, 0, "  dismiss!", 12, 1, oled_buf);
   	   	   er_oled_string(0, 20, "TIME NOW IS:", 12, 1, oled_buf);
   	   	   er_oled_display(oled_buf);

   	   	   osDelay(1000);

   	   	   osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
   	   	   HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
   	   	   HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
   	   	   osMutexRelease(rtcMutexHandle);

   	   	   hrs = RTC_Bcd2ToByte(cTime.Hours);
   	   	   mins = RTC_Bcd2ToByte(cTime.Minutes);
   	   	   sprintf (time, "%02d%02d", hrs, mins);
   	   	   er_oled_time(time);

	       osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
	       GlobalState.lastSeenTime.time = cTime;
	       GlobalState.lastSeenTime.date = cDate;
	       osMutexRelease(lastSeenMutexHandle);

	       bleSendData.sendType = TX_TIME_SEEN;
	       bleSendData.data = 0x0000;
	       osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

	       updateInterval();

	       osMutexAcquire(modeMutexHandle, portMAX_DELAY);
	       GlobalState.programMode = MODE_RESTING;
	       osMutexRelease(modeMutexHandle);

	       osDelay(3000);
	       er_oled_clear(oled_buf);
	       er_oled_display(oled_buf);
	       break;

        case MODE_SHOW_TIME:
		   //show time, no cancel, but does the same thing

		   er_oled_clear(oled_buf);
		   er_oled_string(0, 0, " completed", 12, 1, oled_buf);
		   er_oled_string(0, 20, "TIME NOW IS:", 12, 1, oled_buf);
		   er_oled_display(oled_buf);

		   osDelay(1000);

		   osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
		   HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
		   HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
		   osMutexRelease(rtcMutexHandle);

		   hrs = RTC_Bcd2ToByte(cTime.Hours);
		   mins = RTC_Bcd2ToByte(cTime.Minutes);
		   sprintf (time, "%02d%02d", hrs, mins);
		   er_oled_time(time);

		   osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
		   GlobalState.lastSeenTime.time = cTime;
		   GlobalState.lastSeenTime.date = cDate;
		   osMutexRelease(lastSeenMutexHandle);

		   bleSendData.sendType = TX_TIME_SEEN;
		   bleSendData.data = 0x0000;
		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		   updateInterval();

		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		   GlobalState.programMode = MODE_RESTING;
		   osMutexRelease(modeMutexHandle);

		   osDelay(3000);
		   er_oled_clear(oled_buf);
		   er_oled_display(oled_buf);
		   break;

       case MODE_ERROR:
    	   //ERROR condition: print condition and loop forever

    	   er_oled_clear(oled_buf);
    	   er_oled_string(0, 12, errorCondition, 12, 1, oled_buf);
    	   er_oled_display(oled_buf);
    	   for (;;){}
    	   break;

       case MODE_CLEAR:
    	   //Timeout, notify and wait until clear
    	   //show time and restart

		   er_oled_clear(oled_buf);
		   er_oled_string(0, 10, "  TIMEOUT!", 12, 1, oled_buf);
		   er_oled_string(0, 28, " hit button", 12, 1, oled_buf);
		   er_oled_display(oled_buf);

		   osDelay(500);
    	   break;

       case MODE_ESM_TIME_ESTIMATE:
    	  er_oled_clear(oled_buf);
    	  er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
    	  er_oled_display(oled_buf);
    	  osDelay(100);
    	  break;

       case MODE_ESM_SURVEY:
    	  er_oled_clear(oled_buf);
    	  er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);
    	  er_oled_display(oled_buf);
    	  osDelay(100);
    	  break;

       case MODE_RESTING:
		   osDelay(250);
		   if (GlobalState.paused){
			   er_oled_clear(oled_buf);
			   er_oled_string(0, 14, "   paused", 12, 1, oled_buf);
			   er_oled_display(oled_buf);
		   }
		   break;

       default:
    	   osDelay(20);
    	   break;
       }

     }
     // comment out when doing angle adjustments -- */
    }



  /* USER CODE END startUIControl */
}


uint8_t check_time_bounds(uint8_t curr_hrs){
	//check time bounds, account for wrap (i.e. give time bounds of 10a-3a)

	uint8_t starthr = RTC_Bcd2ToByte(GlobalState.timeBound.startHR_BCD);
	uint8_t endhr = RTC_Bcd2ToByte(GlobalState.timeBound.endHR_BCD);

	if (starthr < endhr){
		return (curr_hrs >= starthr && curr_hrs < endhr);
	} else {
		return (curr_hrs >= starthr || curr_hrs < endhr);
	}

}

/* USER CODE BEGIN Header_startESMMain */
/**
* @brief Function implementing the esmMain thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startESMMain */
void startESMMain(void *argument)
{
  /* USER CODE BEGIN startESMMain */


  const BLETX_Queue_t bleSendInit = {TX_SURVEY_INITIALIZED, 0x0000};

  uint32_t notification;

  RTC_TimeTypeDef cTime;
  RTC_DateTypeDef cDate;

  uint8_t last_hrs, last_min;
  uint32_t last_date;

  /* Infinite loop */
  for(;;)
  {

	//only check time 3 times a min to see if we need a survey
    osDelay(20000); //20 sec delay

    //Grab current time
    osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
    HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
    osMutexRelease(rtcMutexHandle);

    uint8_t curr_hrs = RTC_Bcd2ToByte(cTime.Hours);
    uint8_t curr_min = RTC_Bcd2ToByte(cTime.Minutes);

    //Get a date in YYMMDD format so we can easily compare relative values
    uint32_t curr_date = (cDate.Year << 16) | (cDate.Month << 8) | cDate.Date;

    //Grab last seen time hrs/min and date

