davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    if (ESM_SEPARATE_TIME_ESTIMATE){

    	last_hrs = RTC_Bcd2ToByte(GlobalState.lastSurveyTime.time.Hours);
		last_min = RTC_Bcd2ToByte(GlobalState.lastSurveyTime.time.Minutes);
		last_date = (GlobalState.lastSurveyTime.date.Year << 16) |
					(GlobalState.lastSurveyTime.date.Month << 8) |
					 GlobalState.lastSurveyTime.date.Date;

    } else {

    	last_hrs = RTC_Bcd2ToByte(GlobalState.lastSeenTime.time.Hours);
    	last_min = RTC_Bcd2ToByte(GlobalState.lastSeenTime.time.Minutes);
    	last_date = (GlobalState.lastSeenTime.date.Year << 16) |
    	    		(GlobalState.lastSeenTime.date.Month << 8) |
    				 GlobalState.lastSeenTime.date.Date;
    }

    uint8_t sameDayFlag = 1;

    //Going to do time in minutes for ease.  60 min *24 hours = 1440 min / day

    uint16_t current_time_in_min = (60*curr_hrs + curr_min);

    uint16_t thresh_time_in_min = (60*last_hrs + last_min + GlobalState.currentInterval);
	if (thresh_time_in_min >= 1440){
		thresh_time_in_min %= 1440;
		sameDayFlag = 0;
	}

	// if thresh time doesn't roll over, we can safely assume that any time <= thresh_time
	// should trigger (sameDayFlag=1)
	// if we *do* roll over, any day that is greater than the last_seen_day should trigger

    //Init Survey:
    // TIME BOUNDS for current time hrs
    // curr_time == last_time + interval  (minute resolution, this is checked every 15 sec).
    // programMode is RESTING
    // not GlobalState.paused
    if (GlobalState.programMode == MODE_RESTING && !GlobalState.paused &&
    	check_time_bounds(curr_hrs) && current_time_in_min >= thresh_time_in_min &&
		(sameDayFlag | (curr_date > last_date )) ){

    	//send TX_SURVEY_INITIALIZED
    	osMessageQueuePut(bleTXqueueHandle, &bleSendInit, 0, 0);

    	//set program mode to MODE_ESM_TIME_ESTIMATE
    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    	GlobalState.programMode = MODE_ESM_TIME_ESTIMATE;
    	osMutexRelease(modeMutexHandle);

    	//clear UI notification flags
    	xTaskNotifyStateClear(NULL);

    	uint8_t continue_flag = 1;

    	//(1) Alert Loop and ESM_TIME_ESTIMATE
    	uint8_t keep_alerting = 1;
    	while(keep_alerting){

    		//alert
    		xTaskNotifyGive(alertHandle);
    		//wait for notification from UI thread that indicates start of user interaction
    		notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(ALERT_TIMEOUT));
       	    if (notification){ //not a timeout, interaction started
        		keep_alerting = 0;
     		}
    	    if (GlobalState.programMode != MODE_ESM_TIME_ESTIMATE){
    	    	//button press has changed mode and canceled interaction. want to exit alert loop.
    	    	keep_alerting = 0;
    	    	continue_flag = 0;
    	    }

    	    osDelay(10);
        }

    	//SECOND SCREEN FOR ESM - FOCUS
    	if (continue_flag){
    		//(2) Wait for notification from UI thread that indicates confirmed input
    		notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

    		if (GlobalState.programMode != MODE_ESM_TIME_ESTIMATE){
    			//if our mode has changed, we had a dismiss/snooze event
    			continue_flag = 0;
    		}
    	}

    	if (continue_flag){
    		if (notification){//not timed out, had a confirmed event
    			//set up next interaction
    			//set up survey
    			osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
    			strncpy(GlobalState.surveyState.screenText, "    FOCUS?", strlen("    FOCUS?") + 1);
    			GlobalState.surveyState.screenTextLength = strlen("    FOCUS?");
    			GlobalState.surveyState.surveyID = SURVEY_FOCUS;
    			memcpy(GlobalState.surveyState.optionArray, opts_arousal, sizeof(opts_arousal));
    			GlobalState.surveyState.optionArrayLength = 5;
    			osMutexRelease(surveyMutexHandle);

    			//programMode
    			osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			GlobalState.programMode = MODE_ESM_SURVEY;
    			osMutexRelease(modeMutexHandle);

    		} else {//timed out due to inactivity
    			continue_flag = 0;

    			osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			GlobalState.programMode = MODE_CLEAR;
    			osMutexRelease(modeMutexHandle);
    		}
    	}

    	//THIRD SCREEN FOR ESM - ALERTNESS/AROUSAL
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " ALERTNESS?", strlen(" ALERTNESS?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" ALERTNESS?");
				GlobalState.surveyState.surveyID = SURVEY_AROUSAL;
				memcpy(GlobalState.surveyState.optionArray, opts_arousal, sizeof(opts_arousal));
				GlobalState.surveyState.optionArrayLength = 5;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//FOURTH SCREEN FOR ESM - EMOTION/VALENCE
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, "  EMOTION?", strlen("  EMOTION?") + 1);
				GlobalState.surveyState.screenTextLength = strlen("  EMOTION?");
				GlobalState.surveyState.surveyID = SURVEY_VALENCE;
				memcpy(GlobalState.surveyState.optionArray, opts_valence, sizeof(opts_valence));
				GlobalState.surveyState.optionArrayLength = 5;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//FIFTH SCREEN FOR ESM - COG LOAD
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, "COG. EFFORT?", strlen("COG. EFFORT?") + 1);
				GlobalState.surveyState.screenTextLength = strlen("COG. EFFORT?");
				GlobalState.surveyState.surveyID = SURVEY_COGLOAD;
				memcpy(GlobalState.surveyState.optionArray, opts_arousal, sizeof(opts_arousal));
				GlobalState.surveyState.optionArrayLength = 5;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//SIXTH SCREEN FOR ESM - STRESS
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, "  STRESS?", strlen("  STRESS?") + 1);
				GlobalState.surveyState.screenTextLength = strlen("  STRESS?");
				GlobalState.surveyState.surveyID = SURVEY_STRESS;
				memcpy(GlobalState.surveyState.optionArray, opts_arousal, sizeof(opts_arousal));
				GlobalState.surveyState.optionArrayLength = 5;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//SEVENTH SCREEN FOR ESM - CAFFEINE
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " CAFFEINE?", strlen(" CAFFEINE?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" CAFFEINE?");
				GlobalState.surveyState.surveyID = SURVEY_CAFFEINE;
				memcpy(GlobalState.surveyState.optionArray, opts_yes, sizeof(opts_yes));
				GlobalState.surveyState.optionArrayLength = 2;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}
		/*
		//EIGHTH SCREEN FOR ESM - EXERCISE
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " EXERCISE?", strlen(" EXERCISE?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" EXERCISE?");
				GlobalState.surveyState.surveyID = SURVEY_EXERCISE;
				memcpy(GlobalState.surveyState.optionArray, opts_yes, sizeof(opts_yes));
				GlobalState.surveyState.optionArrayLength = 2;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

