davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
		//NINETH SCREEN FOR ESM - TIME CUE
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " TIME CUE?", strlen(" TIME CUE?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" TIME CUE?");
				GlobalState.surveyState.surveyID = SURVEY_TIMECUE;
				memcpy(GlobalState.surveyState.optionArray, opts_yes, sizeof(opts_yes));
				GlobalState.surveyState.optionArrayLength = 2;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//TENTH SCREEN FOR ESM - LOCATION
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " LOCATION?", strlen(" LOCATION?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" LOCATION?");
				GlobalState.surveyState.surveyID = SURVEY_LOCATE;
				memcpy(GlobalState.surveyState.optionArray, opts_location, sizeof(opts_location));
				GlobalState.surveyState.optionArrayLength = 2;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}
		*/
		//ELEVENTH SCREEN FOR ESM - THERMAL SENSATION
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, " SENSATION?", strlen(" SENSATION?") + 1);
				GlobalState.surveyState.screenTextLength = strlen(" SENSATION?");
				GlobalState.surveyState.surveyID = SURVEY_TSENSE;
				memcpy(GlobalState.surveyState.optionArray, opts_thermalsense, sizeof(opts_thermalsense));
				GlobalState.surveyState.optionArrayLength = 7;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//TWELFTH SCREEN FOR ESM - THERMAL PREF
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, "TEMP PREFER?", strlen("TEMP PREFER?") + 1);
				GlobalState.surveyState.screenTextLength = strlen("TEMP PREFER?");
				GlobalState.surveyState.surveyID = SURVEY_TCOMFORT;
				memcpy(GlobalState.surveyState.optionArray, opts_thermalcomfort, sizeof(opts_thermalcomfort));
				GlobalState.surveyState.optionArrayLength = 3;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		//FINISH ESM; SHOW TIME
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//completed survey with no problem!

				//back to rest, show time
				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_SHOW_TIME;
				osMutexRelease(modeMutexHandle);;

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

		updateLastSurveyTime();

    } else {//not time for a survey

    	//get hour for last_seen + interval (trigger) time
    	uint8_t extra_hours = (last_min + GlobalState.currentInterval) / 60;
    	last_hrs = (last_hrs + extra_hours) % 24;

    	//if next trigger is outside of timebound (i.e. last seen time is end of the day) AND
    	//its the morning (curr_hr = startHR), put it in paused mode, wait for user to initiate.
    	if (!check_time_bounds(last_hrs) && (curr_hrs == RTC_Bcd2ToByte(GlobalState.timeBound.startHR_BCD)) && !GlobalState.paused){
    		GlobalState.paused = 1;
    		const BLETX_Queue_t bleSendPause = {TX_BEGIN_PAUSE, 0x0000};
     		osMessageQueuePut(bleTXqueueHandle, &bleSendPause, 0, 0);


