davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    	}

    }


  }
  /* USER CODE END startESMMain */
}

/* USER CODE BEGIN Header_startButtonPress */
/**
* @brief Function implementing the buttonPress thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startButtonPress */
void startButtonPress(void *argument)
{
  /* USER CODE BEGIN startButtonPress */
  /* Infinite loop */

  //Buttons are PULLED UP and drop to 0 when pressed
  uint8_t buttonState[] = {1, 1, 1};
  uint32_t callingPin = 0x00;

  const BLETX_Queue_t bleSendData = {TX_PREVIOUS_INVALID, 0x0000};

  for(;;)
  {
	//wait for rising or falling edge trigger, put calling pin in callingPin
	xTaskNotifyWait(0x00, 0x00, &callingPin, portMAX_DELAY);

	//check state of pin
	GPIO_PinState first_read = HAL_GPIO_ReadPin(GPIOB, callingPin);

	//wait 50ms
    osDelay(50);

    //check again (debounce) to get a good reading
	if (first_read == HAL_GPIO_ReadPin(GPIOB, callingPin)){

		//check that we are actually changing state; the edge trigger should only call
		//when this happens (except during debouncing) so we expect this to be true
		//almost always

		//callingPin can be used as bitmask Pin 5/4/3 give 1000000/10000/1000

		if (callingPin == 0b1000 && first_read != buttonState[0]) { //button 1 trigger
		  //set buttonState
		  buttonState[0] = first_read;

		  //do stuff if button pressed
		  if (!first_read){
			  osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

			  GlobalState.paused = 0;
			  GlobalState.demo = 0;

			  osMutexAcquire(modeMutexHandle, portMAX_DELAY);
			  GlobalState.programMode = MODE_CANCEL;
			  osMutexRelease(modeMutexHandle);

		  }

		}
		if (callingPin == 0b10000 && first_read != buttonState[1]) { //button 2 trigger
		    //set buttonState
		    buttonState[1] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		    	osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		    	GlobalState.paused = 0;
		    	GlobalState.demo = 0;

		    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    	GlobalState.programMode = MODE_CANCEL;
		    	osMutexRelease(modeMutexHandle);

		    }
		}
		if (callingPin == 0b100000 && first_read != buttonState[2]) { //button 3 trigger
		    //set buttonState
		    buttonState[2] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		    	osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		    	GlobalState.paused = 0;
		    	GlobalState.demo = 0;

		    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    	GlobalState.programMode = MODE_CANCEL;
		        osMutexRelease(modeMutexHandle);

		        if (!buttonState[0]){
		        	//if the first button is pressed AND we've pressed this button, demo mode
		        	GlobalState.demo = 1;
		        	xTaskNotifyGive(alertHandle);
		        }
		    }
		}

	}

  }
  /* USER CODE END startButtonPress */
}

/* USER CODE BEGIN Header_startAlert */
/**
* @brief Function implementing the alert thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startAlert */
void startAlert(void *argument)
{
  /* USER CODE BEGIN startAlert */

  //xTaskNotifyGive(alertHandle); to alert user with flash and vibration

  //HAL_GPIO_WritePin(VIBRATION_GPIO_Port, VIBRATION_Pin, GPIO_PIN_RESET);

  //Init Vibration Motor PWM Parameters
  int duty_cycle = 79; //0 is off, up to ~80
  htim1.Instance->CCR2 = duty_cycle;

  //Dotstar Init
  DotStar_InitHandle dotstar;
  dotstar.spiHandle = &hspi1;
  dotstar.numLEDs = NUM_PIXELS;
  dotstar.colorOrder = DOTSTAR_BGR;
  Dotstar_Init(&dotstar);

  ds_clear();  //turn off
  ds_show();

  const uint8_t MAX_BRIGHTNESS = 0xAA; //max brightness, 0x01-0xFF

  ds_setBrightness(0);
  osDelay(1000);

  uint16_t counter;
  uint32_t color;
  uint8_t r,g,b;
  uint8_t LEDDirection, LEDBrightness;

  /* Infinite loop */
  for(;;)
  {

	counter = 0;
	LEDDirection = 0;
	LEDBrightness = 0;

	ulTaskNotifyTake( pdTRUE, portMAX_DELAY);

	//start vibration
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);

	//flash loop
	ds_fill(0xFFFFFF, 0, 12);

	while (counter++ < MAX_BRIGHTNESS*2) {

		ds_setBrightness(LEDBrightness);
		ds_show();

		//increment color intensity
		if (LEDDirection) {LEDBrightness--;}
		else {LEDBrightness++;}

		//if we hit a limit switch color scaling up or down
		if (LEDBrightness == MAX_BRIGHTNESS) {LEDDirection = 1;}
		if (LEDBrightness == 0x00) {LEDDirection = 0;}

		osDelay(pdMS_TO_TICKS(2)); //2ms delay
	}

	//turn off LEDs
	ds_setBrightness(0);
	ds_fill(0x000000, 0, 12);
	ds_show();

	osDelay(pdMS_TO_TICKS(100)); //100ms delay

    //stop vibration
    HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);

    //if we're in demo mode, flash some LEDs
    if (GlobalState.demo){

    	counter = 0;
    	r = 0xFF;
    	g = 0xFF;
    	b = 0xFF;

    	ds_setBrightness(MAX_BRIGHTNESS);
    	while(GlobalState.demo) {

    		for (int i=0; i< NUM_PIXELS; i++){

    			if      (i==(counter+2)%12)	{ color = (r  <<16) | (g  <<8) | b; }
    			else if (i==(counter+1)%12) { color = (r/2<<16) | (g/2<<8) | b/2; }
    			else if (i==counter)        { color = (r/4<<16) | (g/4<<8) | b/4; }
    			else 						{ color = 0x000000; }

    			ds_setPixelColor32B(i, color); // 'off' pixel at head
    		}

    		ds_show();
    		r = (r + 11) % 0xFF;
    		g = (g + 13) % 0xFF;
    		b = (b + 17) % 0xFF;
    		counter = (counter+1)%12;
    		osDelay(pdMS_TO_TICKS(50));
    	}

    	//turn off LEDs
		ds_setBrightness(0);
		ds_fill(0x000000, 0, 12);
		ds_show();
    }

  }
  /* USER CODE END startAlert */
}

/* USER CODE BEGIN Header_startConditionsPoll */
/**
* @brief Function implementing the conditionsPoll thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startConditionsPoll */
void startConditionsPoll(void *argument)
{
	osDelay(500); //let screen start first

	//poll ambient temp, humidity, visible light, white light
	//every 5sec
  	if (veml_Setup(hi2c1, VEML_5S_POLLING) == HAL_ERROR){
  		//error condition
  		strncpy(errorCondition, "ERR:VEML7700", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

