davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
  	if (si7021_set_config(&hi2c1, SI7021_HEATER_OFF, SI7021_RESOLUTION_RH12_TEMP14) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021CF", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

  	if (si7021_set_heater_power(&hi2c1, SI7021_HEATER_POWER_3MA) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021HT", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	float lux;
  	float whiteLux;
  	float humidity;
    float temperature;

    const BLETX_Queue_t bleSendData = {TX_TEMP_HUMD, 0x0000};

  	for (;;){

  		lux = veml_Get_Lux();
    	whiteLux = veml_Get_White_Lux();
    	temperature = si7021_measure_temperature(&hi2c1);
    	humidity = si7021_measure_humidity(&hi2c1);

    	osMutexAcquire(conditionMutexHandle, portMAX_DELAY);
    	GlobalState.lastConditions.lux = lux;
    	GlobalState.lastConditions.whiteLux = whiteLux;
    	GlobalState.lastConditions.temp = temperature;
    	GlobalState.lastConditions.humd = humidity;
    	osMutexRelease(conditionMutexHandle);

		osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

    	osDelay(29900);
  	}

/* USER CODE END startConditionsPoll */
}


/* USER CODE BEGIN Header_startBLETX */
/**
* @brief Function implementing the bleTX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLETX */
void startBLETX(void *argument)
{
  /* USER CODE BEGIN startBLETX */

  //TX_TIME_SEEN - data in GlobalState.lastSeenTime
  //TX_TEMP_HUMD - construct both TX_TEMP_HUMD/TX_LUX_WHITELUX
  //               with data in GlobalState.lastConditions

  //TX_PREVIOUS_INVALID -- just send that timestamped
  //TX_SURVEY_INITIALIZED -- just send that timestamped

  //TX_TIME_EST - use data in sendData, first byte is hr second byte is min
  //TX_TIMESTAMP_UPDATE -- use data in sendData for error, to send
  //TX_SURVEY_RESULT -- use data in sendData, first byte is survey/second is answer

  BLETX_Queue_t sendData;

  UnsentQueueAddress_t DataQueue = NULL;

  RTC_TimeTypeDef cTime;
  RTC_DateTypeDef cDate;
  uint16_t sendval[10] = {0};
  uint16_t lightval[4] = {0};
  uint8_t numBytes = 0;

  /* Infinite loop */
  for(;;)
  {
        if (osMessageQueueGet(bleTXqueueHandle, &sendData, NULL, osWaitForever) == osOK){

          //construct timestamped data to send
          osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
          HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
          HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
          osMutexRelease(rtcMutexHandle);

          switch (sendData.sendType){
            case TX_PREVIOUS_INVALID:
            case TX_SURVEY_INITIALIZED:
            case TX_BEGIN_PAUSE:

            	sendval[4] = (cDate.WeekDay << (8*1)) | cDate.Month;
            	sendval[3] = (cDate.Date << (8*1)) | cDate.Year;
            	sendval[2] = (cTime.Hours << (8*1)) | cTime.Minutes;
            	sendval[1] = (cTime.Seconds << (8*1)) | cTime.TimeFormat;
            	sendval[0] = sendData.sendType;
            	numBytes = 10;
            	break;

            case TX_TIME_EST:
            case TX_TIMESTAMP_UPDATE:
            case TX_SURVEY_RESULT:
            	sendval[5] = (cDate.WeekDay << (8*1)) | cDate.Month;
            	sendval[4] = (cDate.Date << (8*1)) | cDate.Year;
            	sendval[3] = (cTime.Hours << (8*1)) | cTime.Minutes;
            	sendval[2] = (cTime.Seconds << (8*1)) | cTime.TimeFormat;
            	sendval[1] = sendData.sendType;
            	sendval[0] = sendData.data;
            	numBytes = 12;
            	break;

            case TX_TIME_SEEN:
            	sendval[8] = (cDate.WeekDay << (8*1)) | cDate.Month;
            	sendval[7] = (cDate.Date << (8*1)) | cDate.Year;
            	sendval[6] = (cTime.Hours << (8*1)) | cTime.Minutes;
            	sendval[5] = (cTime.Seconds << (8*1)) | cTime.TimeFormat;
            	sendval[4] = sendData.sendType;

                osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
                cTime = GlobalState.lastSeenTime.time;
                cDate = GlobalState.lastSeenTime.date;
                osMutexRelease(lastSeenMutexHandle);

                sendval[3] = (cDate.WeekDay << (8*1)) | cDate.Month;
                sendval[2] = (cDate.Date << (8*1)) | cDate.Year;
                sendval[1] = (cTime.Hours << (8*1)) | cTime.Minutes;
                sendval[0] = (cTime.Seconds << (8*1)) | cTime.TimeFormat;
            	numBytes = 18;
            	break;

            case TX_TEMP_HUMD:
            case TX_LUX_WHITELUX:
            	sendval[8] = (cDate.WeekDay << (8*1)) | cDate.Month;
            	sendval[7] = (cDate.Date << (8*1)) | cDate.Year;
            	sendval[6] = (cTime.Hours << (8*1)) | cTime.Minutes;
            	sendval[5] = (cTime.Seconds << (8*1)) | cTime.TimeFormat;
            	sendval[4] = TX_TEMP_HUMD;
            	numBytes = 18;

            	osMutexAcquire(conditionMutexHandle, portMAX_DELAY);
            	memcpy(&(sendval[2]), &GlobalState.lastConditions.temp, 4);
            	memcpy(sendval, &GlobalState.lastConditions.humd, 4);
            	memcpy(&(lightval[2]), &GlobalState.lastConditions.lux, 4);
            	memcpy(lightval, &GlobalState.lastConditions.whiteLux, 4);
            	osMutexRelease(conditionMutexHandle);
            	break;

                //CONSTRUCT SECOND PACKET FOR CONDITIONS
                //sendval[4] = TX_LUX_WHITELUX
                //memcpy(sendval, lightval, 8);
          }


          //try to send queued data if we have a queue
          uint8_t dataSuccessFlag = 1;
          uint8_t failed_attempts = 0;
		  const uint8_t MAX_ATTEMPTS = 50;

          if (!P2P_Server_App_Context.Connected) { dataSuccessFlag = 0;}

          while(DataQueue && dataSuccessFlag){//we have data queued and have not failed to send data

        	  //try to send data at front of list
        	  if (P2PS_STM_App_Update_Int8(P2P_NOTIFY_CHAR_UUID, (uint8_t *)DataQueue->packet, DataQueue->numBytes) == BLE_STATUS_SUCCESS){

        		  //if successful, move dataQueue to next, which is NULL for last element, and free memory
        		  UnsentQueueAddress_t addressJustSent = DataQueue;
        		  DataQueue = DataQueue->next;

        		  vPortFree(addressJustSent->packet);
        		  vPortFree(addressJustSent);

        		  failed_attempts = 0;
        	  } else {  //if unsuccessful MAX_ATTEMPTS in a row, dataSuccessFlag = 0
        		  failed_attempts +=1;

        		  if (failed_attempts >= MAX_ATTEMPTS){ dataSuccessFlag = 0; }
        		  else { osDelay(2); }
        	  }
          }

        //if we haven't had a data failure with the queue, try to send current data packet
        if (dataSuccessFlag){
        	if (P2PS_STM_App_Update_Int8(P2P_NOTIFY_CHAR_UUID, (uint8_t *)&sendval, numBytes) != BLE_STATUS_SUCCESS){
        		//unsuccessful packet send means we flag it
        		dataSuccessFlag = 0;

