davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
        	} else if (sendData.sendType == TX_TEMP_HUMD){ //if first packet was successful and we're transmitting conditions

        		//construct second packet for conditions
                sendval[4] = TX_LUX_WHITELUX;
                memcpy(sendval, lightval, 8);

                //and send it
        		if (P2PS_STM_App_Update_Int8(P2P_NOTIFY_CHAR_UUID, (uint8_t *)&sendval, numBytes) != BLE_STATUS_SUCCESS){
        		        dataSuccessFlag = 0;
        		}
        	}

        }

        //if we had a data send failure, add current packet to the queue dynamically
        if (!dataSuccessFlag){

        	//malloc the packet data
        	uint16_t *newPacketAddress = pvPortMalloc(numBytes);
        	//copy the packet data in from sendval
        	memcpy(newPacketAddress, sendval, numBytes);

        	//malloc the queue item that points to that data
        	UnsentQueue_t *newQueueItemAddress = pvPortMalloc(sizeof(UnsentQueue_t));
        	//correctly fill the new Queue Item
        	newQueueItemAddress->packet = newPacketAddress;
        	newQueueItemAddress->numBytes = numBytes;
        	newQueueItemAddress->next = NULL;

        	//if DataQueue is empty, simply set the queue address to this one.
        	if (!DataQueue){ DataQueue = newQueueItemAddress; }
        	else {//otherwise traverse until we get null
        		UnsentQueueAddress_t current_node = DataQueue;
        		while (current_node->next){ //while the pointer to the next is not null
        			current_node = current_node->next; //update current_node to next
        		}
        		current_node->next = newQueueItemAddress;
        	}

        	if (sendData.sendType == TX_TEMP_HUMD && sendval[4] == TX_TEMP_HUMD){
        		//if we're sending conditions and we didn't successfully move to second packet,
        		//add second packet to data queue as well
        		sendval[4] = TX_LUX_WHITELUX;
        		memcpy(sendval, lightval, 8);

        		//malloc the packet data
				uint16_t *newPacketAddress = pvPortMalloc(numBytes);
				//copy the packet data in from sendval
				memcpy(newPacketAddress, sendval, numBytes);

				//malloc the queue item that points to that data
				UnsentQueue_t *newQueueItemAddress = pvPortMalloc(sizeof(UnsentQueue_t));
				//correctly fill the new Queue Item
				newQueueItemAddress->packet = newPacketAddress;
				newQueueItemAddress->numBytes = numBytes;
				newQueueItemAddress->next = NULL;

				UnsentQueueAddress_t current_node = DataQueue;

				while (current_node->next){ //while the pointer to the next is not null
					current_node = current_node->next; //update current_node to next
				}

				current_node->next = newQueueItemAddress;

        	}
        }
    }
  }
  /* USER CODE END startBLETX */
}

/* USER CODE BEGIN Header_startBLERX */
/**
* @brief Function implementing the bleRX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLERX */
void startBLERX(void *argument)
{
  /* USER CODE BEGIN startBLERX */
  /* Infinite loop */

  P2PS_STM_Data_t rxData;

  for(;;)
  {

	if (osMessageQueueGet(bleRXqueueHandle, &rxData, NULL, osWaitForever) == osOK){

		if (rxData.pPayload[0] == 0x00) { // timestamp update starts with 0x00
			memcpy(&P2P_Server_App_Context.OTATimestamp, &(rxData.pPayload[1]), 8);
    	    P2P_Server_App_Context.OTA12HrFormat = rxData.pPayload[9];
    		P2P_Server_App_Context.OTADaylightSavings = rxData.pPayload[10];

    	    RTC_TimeTypeDef sTime = {0};
    		RTC_DateTypeDef sDate = {0};

    		uint8_t timestampvals[8];
    		memcpy(timestampvals, &(P2P_Server_App_Context.OTATimestamp), 8);

    		uint8_t AMPM = timestampvals[0];

    		sTime.Hours      = timestampvals[4];
    		sTime.Minutes    = timestampvals[5];
    		sTime.Seconds    = timestampvals[6];
    		sTime.SubSeconds = 0x0;
    		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;

    		if (P2P_Server_App_Context.OTADaylightSavings){ sTime.DayLightSaving = RTC_DAYLIGHTSAVING_ADD1H; }

    		sTime.StoreOperation = RTC_STOREOPERATION_RESET;

    		sDate.WeekDay = timestampvals[0];
    		sDate.Month   = timestampvals[1];
    		sDate.Date    = timestampvals[2];
    		sDate.Year    = timestampvals[3];

    		RTC_TimeTypeDef cTime;
   	        RTC_DateTypeDef cDate;

    		osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    		HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
    		HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
    		if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    	    osMutexRelease(rtcMutexHandle);

    	    //calculate the seconds off between the two.
    	    uint8_t prev_hrs = RTC_Bcd2ToByte(cTime.Hours);
    	    uint8_t prev_min = RTC_Bcd2ToByte(cTime.Minutes);
    	    uint8_t prev_sec = RTC_Bcd2ToByte(cTime.Seconds);

    	    uint8_t new_hrs = RTC_Bcd2ToByte(sTime.Hours);
    	    uint8_t new_min = RTC_Bcd2ToByte(sTime.Minutes);
    	    uint8_t new_sec = RTC_Bcd2ToByte(sTime.Seconds);

    	    int32_t new_totalsec = (60*60*new_hrs + 60*new_min + new_sec); //86400 sec in day
    	    int32_t prev_totalsec = (60*60*prev_hrs + 60*prev_min + prev_sec);

    	    int32_t forward_diff;
    	    int32_t backward_diff;

    	    int16_t signed_sec_difference; //cant hold more than 9 hours difference

    	    if (new_totalsec > prev_totalsec) {
    	    	forward_diff  = new_totalsec - prev_totalsec;
    	    	backward_diff = 86400 - forward_diff;
    	    } else {
    	    	backward_diff = prev_totalsec - new_totalsec;
    	    	forward_diff  = 86400 - backward_diff;
    	    }

    	    if (backward_diff < forward_diff){
    	    	signed_sec_difference= -1 * backward_diff;
    	    }else {
    	    	signed_sec_difference = forward_diff;
    	    }

    	    BLETX_Queue_t bleSendUpdate = {TX_TIMESTAMP_UPDATE, 0x00};
			bleSendUpdate.data = (uint16_t)signed_sec_difference;
			osMessageQueuePut(bleTXqueueHandle, &bleSendUpdate, 0, 0);
		}

		else if (rxData.pPayload[0] == 0x01) {//change time bounds
			//startHR, endHR in BCD
			GlobalState.timeBound.startHR_BCD = rxData.pPayload[1];
			GlobalState.timeBound.endHR_BCD  = rxData.pPayload[2];

			GlobalState.paused = 1;
			const BLETX_Queue_t bleSendPause = {TX_BEGIN_PAUSE, 0x0000};
			osMessageQueuePut(bleTXqueueHandle, &bleSendPause, 0, 0);
		}

		else if (rxData.pPayload[0] == 0x02) {//pause or unpause watch

			if (rxData.pPayload[1]) { //pause things

				GlobalState.paused = 1;
				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_RESTING;
				osMutexRelease(modeMutexHandle);
	    		const BLETX_Queue_t bleSendPause = {TX_BEGIN_PAUSE, 0x0000};
	     		osMessageQueuePut(bleTXqueueHandle, &bleSendPause, 0, 0);

